app/views/users/show.html.erb

          <ul>
          <% if @user.empresa.empleados.empty?%>
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

        <% else %>
          <% if !@user.simulaciones_realizadas.empty?%>
            <span class="section-title text-primary mb-3 mb-sm-4">Simulaciones Realizadas </span>
            <% @user.simulaciones_realizadas.each do |simulacion| %>
---
SELECT "simulacions".* FROM "simulacions" WHERE "simulacions"."user_id" = ? AND "simulacions"."realizada" = ?  [["user_id", 1], ["realizada", 0]]
SELECT 1 AS one FROM "simulacions" WHERE "simulacions"."user_id" = ? AND "simulacions"."realizada" = ? LIMIT ?  [["user_id", 2], ["realizada", 0], ["LIMIT", 1]]
SELECT "simulacions".* FROM "simulacions" WHERE "simulacions"."user_id" = ? AND "simulacions"."realizada" = ?  [["user_id", 3], ["realizada", 1]]