app/views/users/show.html.erb

SELECT 1 AS one FROM "simulacions" WHERE "simulacions"."user_id" = ? AND "simulacions"."realizada" = ? LIMIT ?  [["user_id", 1], ["realizada", 1], ["LIMIT", 1]]
SELECT "simulacions".* FROM "simulacions" WHERE "simulacions"."user_id" = ? AND "simulacions"."realizada" = ?  [["user_id", 3], ["realizada", 1]]
---
    <h2> Simulaciones Asignadas </h2><br/>
    <% if !@user.simulaciones_realizadas.empty?%>
        <h3> Realizadas<h3>
        <% @user.simulaciones_realizadas.each do |simulacion| %>