app/controllers/api_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def show_user

        @user = User.find(params[:id])

SELECT "simulacions".* FROM "simulacions" WHERE "simulacions"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "simulacions" SET "realizada" = ?, "updated_at" = ? WHERE "simulacions"."id" = ?  [["realizada", 1], ["updated_at", "2022-06-21 21:42:40.991715"], ["id", 6]]
UPDATE "simulacions" SET "realizada" = ?, "updated_at" = ? WHERE "simulacions"."id" = ?  [["realizada", 1], ["updated_at", "2022-06-20 22:35:31.158570"], ["id", 3]]
---
    def simulacion_realizada
        @simulacion = @simulacion = Simulacion.find(params[:id])
        @simulacion.update(realizada: true)

        if @simulacion.save