app/controllers/empresas_controller.rb

    def crear_usuario
        @user = User.new(user_create_params)
        @user.empresa_id = params[:id]
        if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "nombre", "apellido", "telefono", "encargado", "admin", "empresa_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)