app/controllers/empresas_controller.rb

    def create
        @empresa = Empresa.new(create_params)

        if @empresa.save
---
INSERT INTO "empresas" ("nombre", "direccion", "oficina", "rut", "created_at", "updated_at", "comuna", "region") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def destroy
        @empresa = Empresa.find(params[:id])
        name = @empresa.nombre
        if @empresa.destroy
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "empresas" WHERE "empresas"."id" = ?  [["id", 4]]

    def edit
        @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        @empresa = Empresa.find(params[:id])
        @empresa.update(create_params)
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "empresas" SET "nombre" = ?, "updated_at" = ? WHERE "empresas"."id" = ?  [["nombre", "Nestle"], ["updated_at", "2022-06-18 00:11:38.743640"], ["id", 6]]

    def index
        @empresas = Empresa.all
---
SELECT "empresas".* FROM "empresas"

    def show
        @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def agregar_usuario
        @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def crear_usuario
        @empresa_id = params[:id]
        @user = User.new(user_create_params)
        @user.empresa_id = params[:id]
        if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "nombre", "apellido", "telefono", "encargado", "admin", "empresa_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)