app/controllers/simulacions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "simulacions" ("user_id", "nombre", "realizada", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["nombre", "Microagresion"], ["realizada", 0], ["created_at", "2022-06-20 21:57:22.044345"], ["updated_at", "2022-06-20 21:57:22.044345"]]
---
    def create
        @user = User.find(params[:user_id])
        @simulacion = Simulacion.new(create_params)
        @simulacion.update(user_id: params[:user_id], realizada: false)

        if @simulacion.save

SELECT "simulacions".* FROM "simulacions" WHERE "simulacions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "simulacions" WHERE "simulacions"."id" = ?  [["id", 4]]
---
    def destroy
        @simulacion = Simulacion.find(params[:user_id])
        if @simulacion.destroy

SELECT "simulacions".* FROM "simulacions" WHERE "simulacions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "simulacions" SET "realizada" = ?, "updated_at" = ? WHERE "simulacions"."id" = ?  [["realizada", 1], ["updated_at", "2022-06-22 01:20:19.611190"], ["id", 2]]
---
    def marcar_realizada
        @simulacion = @simulacion = Simulacion.find(params[:simulacion_id])
        @simulacion.update(realizada: true)