app/controllers/users_controller.rb

    def show
        @user = User.find(params[:id])

        if @user.simulaciones.first.realizada
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "simulacions".* FROM "simulacions" WHERE "simulacions"."user_id" = ? AND "simulacions"."realizada" = ?  [["user_id", 1], ["realizada", 0]]

    def encuesta_inicial
        @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def submit_encuesta_inicial
        @user = User.find(params[:user_id])
        if @user.encuesta_inicial?
            flash[:alert] = "Ya has realizado la encuesta inicial"
            redirect_to experience_path(user_id: @user.id)
        end
        @encuesta = EncuestaInicial.new(encuesta_inicial_create_params)
        @encuesta.update(user_id: params[:user_id])

        if @encuesta.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "encuesta_inicials" ("user_id", "pregunta1", "pregunta2", "pregunta3", "pregunta4", "pregunta5", "pregunta6", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)