app/controllers/users_controller.rb

    def submit_encuesta_inicial
        @encuesta = EncuestaInicial.new(encuesta_create_params)
        @encuesta.update(user_id: params[:user_id])

        if @encuesta.save
---
INSERT INTO "encuesta_inicials" ("user_id", "pregunta1", "pregunta2", "pregunta3", "pregunta4", "pregunta5", "pregunta6", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)