app/models/user.rb

  def empresa
    Empresa.find(self.empresa_id)
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def encuesta_inicial
    EncuestaInicial.find_by(user_id: self.id)
---
SELECT "encuesta_inicials".* FROM "encuesta_inicials" WHERE "encuesta_inicials"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]